"""Четкова Наталия
Задание 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите
у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран."""

a = 2
b = 3.14
print(a, "+", b, "=", a + b)
num_poz = int(input("Введите положительное целое число - "))
num_neg = int(input("Введите отрицательное целое число - "))
print("Сумма этих чисел равна - ", num_poz + num_neg)
month = input("Укажите месяц Вашего рождения -  ")